Revit 2025 API
CompoundStructureLayer Constructor
Overload List
Name | Description
CompoundStructureLayer() |  Creates a compound structure layer using default settings.
CompoundStructureLayer(CompoundStructureLayer) |  Creates a copy of a compound structure layer.
CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) |  Creates a default compound structure layer based on the given width, function and material element id.
Top
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace